bubenicek/embedx/cpu/stm32f4/lwip/FreeRTOS/ethernetif.c
/**
 * @file
 * Ethernet Interface Skeleton
 *
 */

/*
 * Copyright (c) 2001-2004 Swedish Institute of Computer Science.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. The name of the author may not be used to endorse or promote products
 *    derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT
 * SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
 * OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
 * OF SUCH DAMAGE.
 *
 * This file is part of the lwIP TCP/IP stack.
 *
 * Author: Adam Dunkels <adam@sics.se>
 *
 */

/*
 * This file is a skeleton for developing Ethernet network interface
 * drivers for lwIP. Add code to the low_level functions and do a
 * search-and-replace for the word "ethernetif" to replace it with
 * something that better describes your network interface.
 */

#include "system.h"

#include "lwip/opt.h"
#include "lwip/def.h"
#include "lwip/mem.h"
#include "lwip/pbuf.h"
#include "lwip/sys.h"
#include "lwip/lwip_timers.h"
#include "netif/etharp.h"
#include "netif/ethernetif.h"
#include "lwip/err.h"
#include "lwip/dhcp.h"

#include "stm32f4x7_eth.h"
#include "stm32f4x7_eth_bsp.h"

TRACE_TAG(ethernetif);
#if !ENABLE_TRACE_HAL
#include "trace_undef.h"
#endif


#define netifMTU                                (1500)
#define netifGUARD_BLOCK_TIME			            ( 250 )

/* Define those to better describe your network interface. */
#define IFNAME0 's'
#define IFNAME1 't'

typedef enum
{
   ETHDRV_STATE_LINK_DOWN,
   ETHDRV_STATE_LINK_UP,
   ETHDRV_STATE_READY

} ethdrv_state_t;

/* MDNS multicast MAX address */
static const uint8_t mdns_mcastaddr[] = {0x01, 0x00, 0x5E, 0x00, 0x00, 0xFB};


static struct netif *s_pxNetIf = NULL;
static xSemaphoreHandle xRxSemaphore = NULL;
static xSemaphoreHandle xTxSemaphore = NULL;
static volatile ethdrv_state_t state = ETHDRV_STATE_LINK_UP;


/* Ethernet Rx & Tx DMA Descriptors */
extern ETH_DMADESCTypeDef  DMARxDscrTab[ETH_RXBUFNB], DMATxDscrTab[ETH_TXBUFNB];

/* Ethernet Receive buffers  */
extern uint8_t Rx_Buff[ETH_RXBUFNB][ETH_RX_BUF_SIZE];

/* Ethernet Transmit buffers */
extern uint8_t Tx_Buff[ETH_TXBUFNB][ETH_TX_BUF_SIZE];

/* Global pointers to track current transmit and receive descriptors */
extern ETH_DMADESCTypeDef  *DMATxDescToSet;
extern ETH_DMADESCTypeDef  *DMARxDescToGet;

/* Global pointer for last received frame infos */
extern ETH_DMA_Rx_Frame_infos *DMA_RX_FRAME_infos;

static void ethernetif_input( void * pvParameters );
static void arp_timer(void *arg);


/**
 * In this function, the hardware should be initialized.
 * Called from ethernetif_init().
 *
 * @param netif the already initialized lwip network interface structure
 *        for this ethernetif
 */
static err_t low_level_init(struct netif *netif)
{
   uint32_t i;

   /* set netif MAC hardware address length */
   netif->hwaddr_len = ETHARP_HWADDR_LEN;

   /* set netif maximum transfer unit */
   netif->mtu = 1500;

   /* Accept broadcast address and ARP traffic */
   netif->flags = NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP;

   s_pxNetIf = netif;

   /* create binary semaphore used for informing ethernetif of frame reception */
   if (xRxSemaphore == NULL)
   {
      xRxSemaphore= xSemaphoreCreateCounting(20,0);
   }

   if (xTxSemaphore == NULL)
   {
      vSemaphoreCreateBinary(xTxSemaphore);
   }

   // Configure GPIO
   if (ETH_BSP_Config() != 0)
   {
      TRACE_ERROR("Eth BSP config failed");
      return ERR_IF;
   }
   TRACE("Eth BSP config OK");

   /* initialize MAC address in ethernet MAC */
   ETH_MACAddressConfig(ETH_MAC_Address0, netif->hwaddr);

   /* Enable MDNS multicast MAC address */
   ETH_MACAddressConfig(ETH_MAC_Address1, (uint8_t *)mdns_mcastaddr);
   ETH_MACAddressPerfectFilterCmd(ETH_MAC_Address1, ENABLE);

   /* Initialize Tx Descriptors list: Chain Mode */
   ETH_DMATxDescChainInit(DMATxDscrTab, &Tx_Buff[0][0], ETH_TXBUFNB);
   /* Initialize Rx Descriptors list: Chain Mode  */
   ETH_DMARxDescChainInit(DMARxDscrTab, &Rx_Buff[0][0], ETH_RXBUFNB);

   /* Enable Ethernet Rx interrrupt */
   for(i = 0; i < ETH_RXBUFNB; i++)
   {
      ETH_DMARxDescReceiveITConfig(&DMARxDscrTab[i], ENABLE);
   }

#ifdef CHECKSUM_BY_HARDWARE
   /* Enable the checksum insertion for the Tx frames */
   {
      for(i = 0; i < ETH_TXBUFNB; i++)
      {
         ETH_DMATxDescChecksumInsertionConfig(&DMATxDscrTab[i], ETH_DMATxDesc_ChecksumTCPUDPICMPFull);
      }
   }
#endif

   /* create the task that handles the ETH_MAC */
   xTaskCreate(ethernetif_input, "ETH_IF", netifINTERFACE_TASK_STACK_SIZE, NULL, netifINTERFACE_TASK_PRIORITY, NULL);

   /* Enable MAC and DMA transmission and reception */
   ETH_Start();

   return ERR_OK;
}


/**
 * This function should do the actual transmission of the packet. The packet is
 * contained in the pbuf that is passed to the function. This pbuf
 * might be chained.
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @param p the MAC packet to send (e.g. IP packet including MAC addresses and type)
 * @return ERR_OK if the packet could be sent
 *         an err_t value if the packet couldn't be sent
 *
 * @note Returning ERR_MEM here if a DMA queue of your MAC is full can lead to
 *       strange results. You might consider waiting for space in the DMA queue
 *       to become availale since the stack doesn't retry to send a packet
 *       dropped because of memory failure (except for the TCP timers).
 */

static err_t low_level_output(struct netif *netif, struct pbuf *p)
{
   struct pbuf *q;
   uint32_t l = 0;
   u8 *buffer;

   if (xSemaphoreTake(xTxSemaphore, netifGUARD_BLOCK_TIME))
   {
      buffer =  (u8 *)(DMATxDescToSet->Buffer1Addr);
      for(q = p; q != NULL; q = q->next)
      {
         memcpy((u8_t*)&buffer[l], q->payload, q->len);
         l = l + q->len;
      }
      if (ETH_Prepare_Transmit_Descriptors(l) != ETH_SUCCESS)
      {
         TRACE_ERROR("ETH_Prepare_Transmit_Descriptors failed");
      }
      
      xSemaphoreGive(xTxSemaphore);
   }

   return ERR_OK;
}


/**
 * Should allocate a pbuf and transfer the bytes of the incoming
 * packet from the interface into the pbuf.
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @return a pbuf filled with the received packet (including MAC header)
 *         NULL on memory error
 */
static inline struct pbuf * low_level_input(struct netif *netif)
{
   struct pbuf *p = NULL, *q;
   u16_t len;
   uint32_t l=0,i =0;
   FrameTypeDef frame;
   u8 *buffer;
   __IO ETH_DMADESCTypeDef *DMARxNextDesc;

   /* Get received frame */
   frame = ETH_Get_Received_Frame_interrupt();
   if (frame.descriptor == NULL)
      return NULL;

   /* check that frame has no error */
   if ((frame.descriptor->Status & ETH_DMARxDesc_ES) == (uint32_t)RESET)
   {

      /* Obtain the size of the packet and put it into the "len" variable. */
      len = frame.length;
      buffer = (u8 *)frame.buffer;

      /* We allocate a pbuf chain of pbufs from the pool. */
      p = pbuf_alloc(PBUF_RAW, len, PBUF_POOL);

      /* Copy received frame from ethernet driver buffer to stack buffer */
      if (p != NULL)
      {
         for (q = p; q != NULL; q = q->next)
         {
            memcpy((u8_t*)q->payload, (u8_t*)&buffer[l], q->len);
            l = l + q->len;
         }
      }
   }

   /* Release descriptors to DMA */
   /* Check if received frame with multiple DMA buffer segments */
   if (DMA_RX_FRAME_infos->Seg_Count > 1)
   {
      DMARxNextDesc = DMA_RX_FRAME_infos->FS_Rx_Desc;
   }
   else
   {
      DMARxNextDesc = frame.descriptor;
   }

   /* Set Own bit in Rx descriptors: gives the buffers back to DMA */
   for (i=0; i<DMA_RX_FRAME_infos->Seg_Count; i++)
   {
      DMARxNextDesc->Status = ETH_DMARxDesc_OWN;
      DMARxNextDesc = (ETH_DMADESCTypeDef *)(DMARxNextDesc->Buffer2NextDescAddr);
   }

   /* Clear Segment_Count */
   DMA_RX_FRAME_infos->Seg_Count =0;


   /* When Rx Buffer unavailable flag is set: clear it and resume reception */
   if ((ETH->DMASR & ETH_DMASR_RBUS) != (u32)RESET)
   {
      /* Clear RBUS ETHERNET DMA flag */
      ETH->DMASR = ETH_DMASR_RBUS;

      /* Resume DMA reception */
      ETH->DMARPDR = 0;
   }

   return p;
}


/**
 * This function is the ethernetif_input task, it is processed when a packet
 * is ready to be read from the interface. It uses the function low_level_input()
 * that should handle the actual reception of bytes from the network
 * interface. Then the type of the received packet is determined and
 * the appropriate input function is called.
 *
 * @param netif the lwip network interface structure for this ethernetif
 */
void ethernetif_input( void * pvParameters )
{
   struct pbuf *p;

   while(1)
   {
      switch(state)
      {
         case ETHDRV_STATE_LINK_DOWN:
         {
            TRACE("Link is down");

            // Eth link is DOWN
            if (netif_is_up(s_pxNetIf))
                netif_set_down(s_pxNetIf);

            state = ETHDRV_STATE_LINK_UP;
         }
         break;

         case ETHDRV_STATE_LINK_UP:
         {
            if (ETH_GetLinkStatus())
            {
               TRACE("Link is UP");

               if (s_pxNetIf->flags & NETIF_FLAG_DHCP)
               {
                  // Restart dhcp
                  dhcp_stop(s_pxNetIf);
                  dhcp_start(s_pxNetIf);

                  TRACE("Start DHCP client");
               }
               else if (!netif_is_up(s_pxNetIf))
               {
                  netif_set_up(s_pxNetIf);
               }

               state = ETHDRV_STATE_READY;
            }
            else
            {
               osDelay(1000);
            }
         }
         break;

         case ETHDRV_STATE_READY:
         {
            if (xSemaphoreTake(xRxSemaphore, portMAX_DELAY) == pdTRUE)
            {
               while((p = low_level_input(s_pxNetIf)) != NULL)
               {
                  //TRACE("RX %d bytes", p->tot_len);

                  if (ERR_OK != s_pxNetIf->input( p, s_pxNetIf))
                  {
                     pbuf_free(p);
                  }
               }
            }
         }
         break;
      }
   }
}

/**
 * Should be called at the beginning of the program to set up the
 * network interface. It calls the function low_level_init() to do the
 * actual setup of the hardware.
 *
 * This function should be passed as a parameter to netif_add().
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @return ERR_OK if the loopif is initialized
 *         ERR_MEM if private data couldn't be allocated
 *         any other err_t on error
 */
err_t ethernetif_init(struct netif *netif)
{
   LWIP_ASSERT("netif != NULL", (netif != NULL));

#if LWIP_NETIF_HOSTNAME
   /* Initialize interface hostname */
   netif->hostname = "lwip";
#endif /* LWIP_NETIF_HOSTNAME */

   netif->name[0] = IFNAME0;
   netif->name[1] = IFNAME1;

   netif->output = etharp_output;
   netif->linkoutput = low_level_output;

   /* initialize the hardware */
   if (low_level_init(netif) != ERR_OK)
   {
      TRACE_ERROR("Low level init");
      return ERR_IF;
   }

   etharp_init();
   sys_timeout(ARP_TMR_INTERVAL, arp_timer, NULL);

   TRACE("ETH interface init");

   return ERR_OK;
}


static void arp_timer(void *arg)
{
   etharp_tmr();
   sys_timeout(ARP_TMR_INTERVAL, arp_timer, NULL);
}

/*
void EXTI3_IRQHandler(void)
{
   portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;

   if (EXTI_GetITStatus(ETH_LINK_EXTI_LINE) != RESET)
   {
      // Clear interrupt pending bit
      EXTI_ClearITPendingBit(ETH_LINK_EXTI_LINE);

      // Clear Phy interrupt flag
      ETH_GetLinkStatus();

      // Link is down
      state = ETHDRV_STATE_LINK_DOWN;

      // Give the semaphore to wakeup LwIP task
      xSemaphoreGiveFromISR(xRxSemaphore, &xHigherPriorityTaskWoken);

      // Switch tasks if necessary.
      if (xHigherPriorityTaskWoken != pdFALSE)
      {
         portEND_SWITCHING_ISR(xHigherPriorityTaskWoken);
      }
  }
}
*/

/**
  * @brief  This function handles ethernet DMA interrupt request.
  * @param  None
  * @retval None
  */
void ETH_IRQHandler(void)
{
  portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;

  // Frame received
  if (ETH_GetDMAFlagStatus(ETH_DMA_FLAG_R) == SET)
  {
    // Give the semaphore to wakeup LwIP task
    xSemaphoreGiveFromISR(xRxSemaphore, &xHigherPriorityTaskWoken);
  }

  // Clear the interrupt flags.
  // Clear the Eth DMA Rx IT pending bits
  ETH_DMAClearITPendingBit(ETH_DMA_IT_R);
  ETH_DMAClearITPendingBit(ETH_DMA_IT_NIS);

  // Switch tasks if necessary.
  if( xHigherPriorityTaskWoken != pdFALSE )
  {
    portEND_SWITCHING_ISR( xHigherPriorityTaskWoken );
  }
}
